# 🛒 Проект 4 — Яндекс Прилавок (API)

## 📋 Описание
Проект посвящён тестированию новой версии API сервиса «Яндекс Прилавок».  
Цель — проверить корректность работы эндпоинтов, связанных с наборами продуктов, корзиной и доставкой.

## 🎯 Задачи
- Изучить документацию API и требования к новой функциональности;
- Составить чек-лист для тестирования эндпоинтов;
- Проверить корректность работы методов:
  - POST /api/v1/kits/{id}/products
  - POST /fast-delivery/v3.1.1/calculate-delivery.xml
  - GET /api/v1/orders/:id
  - PUT /api/v1/orders/:id
  - DELETE /api/v1/orders/:id
- Зафиксировать результаты и оформить баг-репорты.
## 🧰 Инструменты
- Postman  
- REST API  
- HTTP-запросы (GET, POST, PUT, DELETE)  
- Google Sheets  

## 📈 Результаты
- Разработан тестовый чек-лист, покрывающий все ключевые сценарии;
- Проведено тестирование новой функциональности API;
- Выявлены ошибки в обработке запросов и валидации данных;
- Подготовлен отчёт о тестировании для команды разработки.

📎 **Документы:**  
- [Чек-лист](https://docs.google.com/spreadsheets/d/1wilaRS_npgOjtXVH7CCgfqJH3zizueRoqQXso5TL3hQ/edit?gid=899462569#gid=899462569
- [Баг-репорты]https://docs.google.com/spreadsheets/d/1wilaRS_npgOjtXVH7CCgfqJH3zizueRoqQXso5TL3hQ/edit?gid=707930283#gid=707930283
