# 🚘 Проект 2 — Яндекс Маршруты: Каршеринг

## 📋 Описание
Проект посвящён тестированию новой функции бронирования автомобиля в сервисе «Яндекс Маршруты».  
Основная задача — проверить корректность работы интерфейса, логики бронирования и экранов оплаты.

## 🎯 Задачи
- Проверить вёрстку формы бронирования (тариф «Роскошный»);
- Проверить логику окон «Способ оплаты» и «Добавление карты»;
- Составить тест-кейсы для кнопки «Забронировать»;
- Выполнить функциональное тестирование и оформить баг-репорты.

## 🧰 Инструменты
- Google Sheets  
- Ручное функциональное и UI-тестирование  
- Чек-листы, тест-кейсы, баг-репорты  

## 📈 Результаты
- Создана тестовая документация для нового функционала;
- Найдены и задокументированы ошибки в интерфейсе и логике бронирования;
- Подготовлен отчёт по результатам тестирования.

📎 **Документы:**  
- [Чек-лист] https://docs.google.com/spreadsheets/d/1G39vlrbdx4lOLHSnhxns-TIS4Fhp09P7Sta5O63dzr4/edit?gid=1540435533#gid=1540435533
- [Тест-кейсы] https://docs.google.com/spreadsheets/d/1G39vlrbdx4lOLHSnhxns-TIS4Fhp09P7Sta5O63dzr4/edit?gid=1567345705#gid=1567345705 
- [Баг-репорты] https://docs.google.com/spreadsheets/d/1G39vlrbdx4lOLHSnhxns-TIS4Fhp09P7Sta5O63dzr4/edit?gid=977751969#gid=977751969
